app/controllers/movies_controller.rb

    end
    puts "@selected_ratings = "
    puts @selected_ratings
    @movies = Movie.find_all_by_rating(@selected_ratings.keys,ordering)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date