app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "12"]]
---
  def show
#    raise params[:order].inspect
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up  movie by unique ID

SELECT "movies".* FROM "movies" ORDER BY release_date asc
SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Aladdin' LIMIT 1
---
  def index
    sort = params[:sort]# || session[:sort]
    movie = Movie.all
#    puts "sort ="
#    puts sort
#    puts "params[:sort] = "
#    puts params[:sort]
#    puts "session[:sort]"
#    puts session[:sort]
    if sort == 'title'
      @movies = movie.sort_by {|m| m.title}
      @title_header = 'hilite'
      #@movies = Movie.find_by_all_ratings(ordering)
      #@movies = Movie.order_by(session[:sort])
      #ordering,@title_header = {:order => :title}, 'hilite'
    elsif sort == 'release_date'
      @movies = movie.sort_by {|m| m.release_date}.reverse
      @date_header = 'hilite'
    else
      @movies = Movie.all